Revit 2027 API
Connector.DuctSystemType Property
The duct system type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctSystemType DuctSystemType { get; }
Public ReadOnly Property DuctSystemType As DuctSystemType
	Get
public:
property DuctSystemType DuctSystemType {
	DuctSystemType get ();
}
member DuctSystemType : DuctSystemType with get
Property Value
DuctSystemType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainHvac.
InvalidOperationException |  Thrown on failure to get duct system type.
Remarks
This is the instantaneous system type at this connector, calculated according to system. For unconnected connectors, the system type is undefined.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace